---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetServiceTypeName(System.Int32)
source: html/70ab5511-d2f9-d818-d82b-33fd1016c361.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetServiceTypeName Method

Gets the service type name.

## Syntax (C#)
```csharp
public string GetServiceTypeName(
	int serviceTypeId
)
```

## Parameters
- **serviceTypeId** (`System.Int32`) - The service type identifier.